#+TITLE: Portofoliu Algoritmi și complexitate
#+AUTHOR: Pavel Andrei
#+DATE: 2018-2019
#+LANGUAGE: ro
#+LATEX_HEADER: \usepackage{geometry}\geometry{a4paper,left=30mm,right=20mm,top=20mm,bottom=30mm}
#+LATEX_HEADER: \usepackage{titlesec}\titleformat*{\subsection}{}
#+LATEX_HEADER: \usepackage{etoolbox}\AtBeginEnvironment{minted}{\singlespacing\fontsize{12}{14}\selectfont}
#+LATEX_HEADER: \usepackage{mathtools}\usepackage{icomma}\usepackage{stackengine}\usepackage{amssymb}
#+LATEX_HEADER: \usemintedstyle{vs}

# pastie vs xcode emacs borland

#+OPTIONS: toc:nil
#+OPTIONS: num:nil
#+OPTIONS: date:nil
#+ATTR_LATEX: :options frame=single

#+begin_src emacs-lisp :exports results :results none :eval export
  (make-variable-buffer-local 'org-latex-title-command)
  (setq org-latex-title-command "")
#+end_src

#+begin_export latex
\begin{titlepage}
    \begin{center}
        \vspace*{3cm}
 
 
        \Huge
        \textbf{Portofoliu Algoritmi și complexitate - Probleme rezonabile}

        \vspace{0.5cm}
        \LARGE
        Anul I, semestrul 2

        \vspace{2cm}
        \Large
        {Numele tău aici}\\
        \vspace{2cm}
 
        %\vfill
 
    \end{center}
    \Large
        Contribuitori:\\
        - Sabina \\
        - Carla \\
        

        \vspace{2cm}
        \Large
        \noindent
        - Dacă vreți probleme rezolvate mai grele intrati \href{https://github.com/azbyn/fundamentele/blob/master/portofoliu.pdf}{aici};\\
        - Dacă nu înțelegeți ceva întrebați-mă;\\
        - Vă invit sa mai scrieți și problemele voastre (da, știu);\\
        - Nu garantez că problemele puse de alții sunt corecte (să citiți și cerințele);\\
        - Dacă găsiți ceva greșit spuneți-mi;\\
        - Nu scrieți comentariile, sunt mai mult pentru amuzamentul meu;\\
** 6. Problema aia lunga cu integrala definita
#+BEGIN_SRC cpp -n :results output :exports code
// puteți sa nu scrieți liniile astea 2 si functia main
#include <iostream>
using namespace std;

double f(double x) {//f(x) = x^2
     // mai schimbati si voi putin expresia asta, cum ar fi 
     // return x; return 1; return sin(x); ....
     return x * x;
}

// Se poate face si ceva de genu asta ca f sa fie parametru:
//template<typename F>
//double integrate(F f, double a, double b, double eps = 1e-5) {
// sau așa:
//double integrate(double (*f)(double), double a, ...

// daca vreti sa va simtiti mai romani puteti scrie "integreaza"
double integrate(double a, double b, double eps) {
    double delta = b - a;
    if (delta < eps) {
        return delta * (f(a) + f(b)) / 2;
    }
    else {
        double c = (a+b)/2;
        return integrate(a, c, eps) + integrate(c, b, eps);
    }
}
int main() {
     double a, b, eps;
     cin >> a >> b >> eps;
     // cu varianta mai faină merge și ceva de genu ăsta:
     // cout << integrate(sin, a, b) << endl;
     // doar că n-ar trebui să stim d-astea

     cout << integrate(a, b, eps) << endl;

     return 0;
}
#+END_SRC

#+RESULTS:
\pagebreak

